cockroachLoadTest/dev/seedAptRandomId.yml
# artillery run cockroachLoadTest/dev/seedAptRandomId.yml

config:
  target: "http://127.0.0.1:4000"
  processor: "../generator.js"
  http: 30
  phases:
    - duration: 10
      arrivalRate: 100
  defaults:
    headers:
scenarios:
  - name: "register an apartment listing with random generated id"
    flow:
      - function: "generateApartmentData"
      - post:
          url: "/api/listing"
          json:
            price: "{{price}}"
            minStay: "{{minStay}}"
            stars: "{{stars}}"
            numRatings: "{{numRatings}}"
            max: "{{max}}"
      - log: "Sent a request to /api/listing with {{ price }}, {{ stars }}, {{ minStay }}"