cockroachLoadTest/dev/seedDates.yml
# artillery run cockroachLoadTest/dev/seedDates.yml

config:
  target: "http://127.0.0.1:4000"
  processor: "../generator.js"
  http: 10
  phases:
    - duration: 10
      arrivalRate: 500
  defaults:
    headers:
scenarios:
  - name: "register dates to apartments 0-5000"
    flow:
      - function: "generateDateData"
      - post:
          url: "/api/date"
          json:
            apartmentId: "{{apartmentId}}"
            date: "{{date}}"
      - log: "Sent a request to /api/date with {{ apartmentId }}, {{ date }}"